---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.RevisionsOnSheetUIService
source: html/090e24ea-73cb-312f-3444-afb65ca8d4aa.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.RevisionsOnSheetUIService Property

The UI service which permits registration of an external server for new UI managing RevisionsOnSheet selection

## Syntax (C#)
```csharp
public static ExternalServiceId RevisionsOnSheetUIService { get; }
```